In [1]:
import pandas as pd
import queries
from sqlalchemy import create_engine
from secrets import secrets

## Extract Data

In [2]:
engine = create_engine(secrets['indeed_db'])

### Data Analyst

In [3]:
df_da = pd.read_sql_query(queries.jobs_query.format('Data_Analyst'), con=engine)
df_da.head()

,Job_Title,Company,Salary,Location,Date_Posted,Description,Job_URL,Keywords_Present,Title_Keywords
0,DATA ANALYST,D'YANA INTERNATIONAL,None,Malaysia,2020-04-10,Looking for a candidate who loves crunching nu...,https://www.indeed.com.my//rc/clk?jk=52559f104...,"'Data Analysis', 'Excel', 'R', 'Statistics'",None
1,Data Informatics Analyst,National instrument,None,Bayan Lepas,2020-04-23,"APAC Data Informatics Analyst, APAC Sales Info...",https://www.indeed.com.my//rc/clk?jk=e61ab28da...,"'C', 'Go', 'R'",None
2,Data Informatics Analyst,National Instruments,None,Bayan Lepas,2020-04-23,"APAC Data Informatics Analyst, APAC Sales Info...",https://www.indeed.com.my//rc/clk?jk=45d36230e...,"'C', 'Go', 'R'",None
3,Data Analyst (Quality),Latexx,None,Malaysia,2020-04-10,Data Analyst (Quality)ResponsibilitiesLocate a...,https://www.indeed.com.my//rc/clk?jk=4a24763c5...,"'C', 'Excel', 'Java', 'R', 'SAS', 'SPSS', 'SQL...",None
4,BI Data Analyst,Shopee,None,Kuala Lumpur,2020-04-10,Job Description:Work closely with Warehouse te...,https://www.indeed.com.my//rc/clk?jk=8b805d72b...,"'C', 'Python', 'R', 'SQL'",None

In [4]:
df_da.describe(include='object')

,Job_Title,Company,Salary,Location,Date_Posted,Description,Job_URL,Keywords_Present,Title_Keywords
count,5350,5295,1085,5127,5276,5350,5350,5156,1569
unique,1851,768,228,89,174,2354,2808,632,19
top,Principal Salesforce Developer,iPrice group,"RM 5,000 - RM 7,000 a month",Kuala Lumpur,2020-07-26,No Description,https://www.indeed.com.my/rc/clk?jk=60962dcec9...,"'C', 'R'",'Senior'
freq,126,246,98,2006,1988,105,64,1047,862

In [5]:
df_da = df_da.drop_duplicates()
df_da.describe(include='object')

,Job_Title,Company,Salary,Location,Date_Posted,Description,Job_URL,Keywords_Present,Title_Keywords
count,2914,2861,614,2766,2841,2914,2914,2757,720
unique,1851,768,228,89,174,2354,2808,632,19
top,Business Analyst,Ambition,"RM 4,000 - RM 4,500 a month",Kuala Lumpur,2020-04-10,No Description,https://www.indeed.com.my/company/Agensi-Peker...,"'C', 'R'",'Senior'
freq,71,75,29,1207,533,105,3,551,381

### Data Engineer

In [6]:
df_de = pd.read_sql_query(queries.jobs_query.format('Data_Engineer'), con=engine)
df_de.head()

,Job_Title,Company,Salary,Location,Date_Posted,Description,Job_URL,Keywords_Present,Title_Keywords
0,Data Engineer,KPMG,None,Petaling Jaya,2020-05-04,We help organizations to work smarter and grow...,https://www.indeed.com.my//rc/clk?jk=2b236e08a...,"'C', 'Java', 'R'",None
1,Wells Data Engineer,Seacom,None,Malaysia,2020-04-10,Position: Wells Data EngineerLocation: Peninsu...,https://www.indeed.com.my//rc/clk?jk=005edeb55...,'C',None
2,Junior Engineer,Ematic Solutions,None,Malaysia,2020-05-04,JOB DESCRIPTIONWHO WE AREReady for your next c...,https://www.indeed.com.my//rc/clk?jk=b24e15d9c...,"'C', 'Excel', 'R', 'SQL'",'Junior'
3,ITC Engineer,Bombardier,None,Kuala Lumpur,2020-05-06,ITC Engineer-TRCS-MAKU02280520DescriptionAt Bo...,https://www.indeed.com.my//rc/clk?jk=f9b066894...,"'C', 'R'",None
4,Production Engineer,Malayan Flour Mills Berhad,None,Lumut,2020-04-29,Company DescriptionMalayan Flour Mills Berhad ...,https://www.indeed.com.my//rc/clk?jk=1507113f3...,"'C', 'R'",None

In [7]:
df_de.describe(include='object')

,Job_Title,Company,Salary,Location,Date_Posted,Description,Job_URL,Keywords_Present,Title_Keywords
count,6274,6214,1603,6005,6214,6274,6274,5978,1942
unique,2080,985,242,118,168,2739,3304,858,21
top,Software Engineer,iPrice group,"RM 3,500 - RM 5,500 a month",Kuala Lumpur,2020-07-26,No Description,https://www.indeed.com.my/rc/clk?jk=86fa85e68e...,"'C', 'R'",'Senior'
freq,105,326,70,1846,2004,157,64,1495,1173

In [8]:
df_de = df_de.drop_duplicates()
df_de.describe(include='object')

,Job_Title,Company,Salary,Location,Date_Posted,Description,Job_URL,Keywords_Present,Title_Keywords
count,3393,3333,759,3216,3333,3393,3393,3168,877
unique,2080,985,242,118,168,2739,3304,858,21
top,Software Engineer,Micron,"RM 2,500 - RM 3,000 a month",Kuala Lumpur,2020-07-26,No Description,https://www.indeed.com.my//rc/clk?jk=83dfdabca...,"'C', 'R'",'Senior'
freq,64,88,22,992,590,156,2,817,514

### Data Scientist

In [9]:
df_ds = pd.read_sql_query(queries.jobs_query.format('Data_Scientist'), con=engine)
df_ds.head()

,Job_Title,Company,Salary,Location,Date_Posted,Description,Job_URL,Keywords_Present,Title_Keywords
0,Data Scientist,KPMG,None,Petaling Jaya,2020-05-04,We help organizations to work smarter and grow...,https://www.indeed.com.my//rc/clk?jk=af48e13a1...,"'C', 'Deep Learning', 'Machine Learning', 'Nat...",None
1,Data Scientist,Telenor,None,Malaysia,2020-04-10,W e are looking for a data scientist that will...,https://www.indeed.com.my//rc/clk?jk=c0285648d...,"'C', 'Java', 'Python', 'R', 'SQL'",None
2,"Intern, Data Scientist",DiGi Telecommunications,None,Shah Alam,2020-04-10,Do you want to supplement your degree with act...,https://www.indeed.com.my//rc/clk?jk=58ba13258...,"'C', 'R', 'SAS', 'SPSS', 'SQL', 'Statistics'",'Intern'
3,Data Scientist,DiGi Telecommunications,None,Shah Alam,2020-04-10,We are looking for a data scientist that will ...,https://www.indeed.com.my//rc/clk?jk=99ac82133...,"'C', 'Java', 'Python', 'R', 'SQL'",None
4,Data Scientist,Thakral One Solutions Private Limited,None,Kuala Lumpur,2020-04-28,Role: Machine learning engineer/Data Scientist...,https://www.indeed.com.my//rc/clk?jk=abe2b27c7...,"'Artificial Intelligence', 'C', 'Go', 'MySQL',...",None

In [10]:
df_ds.describe(include='object')

,Job_Title,Company,Salary,Location,Date_Posted,Description,Job_URL,Keywords_Present,Title_Keywords
count,817,812,142,794,802,817,817,809,283
unique,218,165,44,34,105,356,405,259,12
top,Data Scientist,Synvue Sdn Bhd,"RM 3,500 - RM 4,500 a month",Kuala Lumpur,2020-07-26,ResponsibilitiesThe Senior Member of the Techn...,https://www.indeed.com.my/rc/clk?jk=a66a2b1201...,"'C', 'Excel', 'R'",'Senior'
freq,111,46,29,345,258,13,12,80,155

In [11]:
df_ds = df_ds.drop_duplicates()
df_ds.describe(include='object')

,Job_Title,Company,Salary,Location,Date_Posted,Description,Job_URL,Keywords_Present,Title_Keywords
count,420,415,72,401,405,420,420,416,129
unique,218,165,44,34,105,356,405,259,12
top,Data Scientist,IHS Markit,"RM 3,500 - RM 4,500 a month",Kuala Lumpur,2020-07-26,Company DescriptionGreat internships are not o...,https://www.indeed.com.my//rc/clk?jk=91d6a98a1...,"'C', 'Excel', 'R'",'Senior'
freq,74,22,13,179,82,7,2,25,63

### Machine Learning Engineer

In [12]:
df_mle = pd.read_sql_query(queries.jobs_query.format('Machine_Learning_Engineer'), con=engine)
df_mle.head()

,Job_Title,Company,Salary,Location,Date_Posted,Description,Job_URL,Keywords_Present,Title_Keywords
0,Machine Learning Engineer,Unlock Design International Sdn Bhd,None,Kuala Lumpur,2020-04-29,Job Description :â—Develop and operate image a...,https://www.indeed.com.my//rc/clk?jk=c992e09ac...,"'AWS', 'C', 'Git', 'Github', 'Python', 'R'",None
1,Machine Learning Engineer,3E Accounting Malaysia,None,Kuala Lumpur,2020-04-10,Description3E Accounting Malaysia is currently...,https://www.indeed.com.my//rc/clk?jk=4becba666...,"'C', 'Machine Learning', 'R'",None
2,DevOps Engineer,AmTrust Mobile Solutions Asia,None,Malaysia,2020-04-10,Division : Tech. Department1. Job PurposeDevel...,https://www.indeed.com.my//rc/clk?jk=8ac2bf1d3...,"'Artificial Intelligence', 'AWS', 'C', 'Docker...",None
3,Senior Site Reliability Engineer,AmTrust Mobile Solutions Asia,None,Malaysia,2020-04-10,Division : Tech. Department1. Job PurposeDevel...,https://www.indeed.com.my//rc/clk?jk=cd7b4f8c2...,"'Artificial Intelligence', 'AWS', 'C', 'Docker...",'Senior'
4,Technical Product Engineer ( Halcon Trainer),EPS Malaysia,None,Malaysia,2020-04-10,Core JOB DESCRIPTION:-Reports directly to the ...,https://www.indeed.com.my//rc/clk?jk=9574f3e9e...,"'C', 'C++', 'Computer Vision', 'Deep Learning'...",None

In [13]:
df_mle.describe(include='object')

,Job_Title,Company,Salary,Location,Date_Posted,Description,Job_URL,Keywords_Present,Title_Keywords
count,571,555,114,544,544,571,571,561,226
unique,218,127,39,41,106,313,362,195,11
top,Senior Data Engineer,Micron,"RM 9,000 - RM 13,000 a month",Kuala Lumpur,2020-07-27,The Senior Data Engineer will be working withi...,https://www.indeed.com.my/rc/clk?jk=772f141038...,"'C', 'R'",'Senior'
freq,55,53,26,175,118,20,6,43,154

In [14]:
df_mle = df_mle.drop_duplicates()
df_mle.describe(include='object')

,Job_Title,Company,Salary,Location,Date_Posted,Description,Job_URL,Keywords_Present,Title_Keywords
count,369,353,67,342,342,369,369,360,129
unique,218,127,39,41,106,313,362,195,11
top,Senior Data Engineer,Micron,"RM 9,000 - RM 13,000 a month",Kuala Lumpur,2020-04-10,The Senior Data Engineer will be working withi...,https://www.indeed.com.my/company/Treal-Techno...,"'C', 'R'",'Senior'
freq,30,44,16,110,47,14,2,28,85

In [15]:
engine.dispose()

## Data Cleaning

### Has Salary

In [18]:
df_das = df_da.loc[df_da['Salary'].notnull()]
df_das.describe(include='object')

,Job_Title,Company,Salary,Location,Date_Posted,Description,Job_URL,Keywords_Present,Title_Keywords
count,614,598,614,605,614,614,614,578,131
unique,411,244,228,57,141,501,588,167,15
top,Data Analyst,Ambition,"RM 4,000 - RM 4,500 a month",Kuala Lumpur,2020-07-26,No Description,https://www.indeed.com.my/company/Agensi-Peker...,"'C', 'R'",'Senior'
freq,29,66,29,217,86,18,3,149,65

In [19]:
df_des = df_de.loc[df_de['Salary'].notnull()]
df_des.describe(include='object')

,Job_Title,Company,Salary,Location,Date_Posted,Description,Job_URL,Keywords_Present,Title_Keywords
count,759,755,759,690,759,759,759,699,157
unique,514,365,242,82,145,616,736,221,11
top,Software Engineer,Reeracoen Malaysia,"RM 2,500 - RM 3,000 a month",Kuala Lumpur,2020-07-26,No Description,https://www.indeed.com.my/company/Treal-Techno...,"'C', 'R'",'Senior'
freq,26,26,22,196,104,38,2,219,112

In [20]:
df_dss = df_ds.loc[df_ds['Salary'].notnull()]
df_dss.describe(include='object')

,Job_Title,Company,Salary,Location,Date_Posted,Description,Job_URL,Keywords_Present,Title_Keywords
count,72,72,72,70,72,72,72,71,10
unique,42,42,44,18,45,68,70,47,4
top,Data Scientist,RCSI Management,"RM 3,500 - RM 4,500 a month",Kuala Lumpur,2020-04-10,Position : Data Scientist ExecutiveSalary Rang...,https://www.indeed.com.my/company/RCSI-Managem...,"'AWS', 'C', 'Go', 'Python', 'R', 'Regression',...",'Lead'
freq,15,6,13,23,7,3,2,14,4

In [21]:
df_mles = df_mle.loc[df_mle['Salary'].notnull()]
df_mles.describe(include='object')

,Job_Title,Company,Salary,Location,Date_Posted,Description,Job_URL,Keywords_Present,Title_Keywords
count,67,67,67,67,67,67,67,67,26
unique,44,33,39,19,47,49,64,40,5
top,Senior Data Engineer,OPC BUSINESS SUPPORT SDN BHD,"RM 9,000 - RM 13,000 a month",Kuala Lumpur,2020-07-27,The Senior Data Engineer will be working withi...,https://www.indeed.com.my/company/NDR-Medical-...,"'C', 'NoSQL', 'Python', 'R', 'SQL', 'Tableau'",'Senior'
freq,16,15,16,28,8,12,2,12,20

### Title Keywords

In [24]:
df_das['Title_Keywords'].unique()

array([None, "'Senior'", "'Lead'", "'Consultant'", "'Junior'", "'Sr'",
       "'Associate', 'Assoc'", "'Intern'", "'Graduate'", "'Sr.', 'Sr'",
       "'Chief'", "'Part-time'", "'Junior', 'Senior'",
       "'Associate', 'Assoc', 'Consultant'", "'Head'",
       "'Senior', 'Consultant'"], dtype=object)

In [25]:
df_des['Title_Keywords'].unique()

array([None, "'Lead'", "'Senior'", "'Intern'", "'Sr'", "'Graduate'",
       "'Jr.', 'Jr', 'Sr.', 'Sr'", "'Senior', 'Lead'", "'Junior'",
       "'Sr.', 'Sr'", "'Head'", "'Consultant'"], dtype=object)

In [26]:
df_dss['Title_Keywords'].unique()

array([None, "'Senior'", "'Lead'", "'Intern'", "'Chief'"], dtype=object)

In [27]:
df_mle['Title_Keywords'].unique()

array([None, "'Senior'", "'Intern'", "'Graduate'", "'Lead'",
       "'Associate', 'Assoc'", "'Junior', 'Senior'", "'Head'",
       "'Consultant'", "'Senior', 'Lead'", "'Sr.', 'Sr'", "'Sr'"],
      dtype=object)

### Extract Salary Information

In [86]:
df_test = df_das.copy()
df_test[['A', 'B']] = df_das['Salary'].str.split('-', 1, expand=True)
df_test = df_test[['Job_Title', 'Salary', 'Title_Keywords', 'A', 'B']]
df_test.head()

,Job_Title,Salary,Title_Keywords,A,B
37,Data Analyst,"RM 2,000 - RM 4,500 a month",None,"RM 2,000","RM 4,500 a month"
84,Master Data Analyst,"RM 2,500 - RM 4,500 a month",None,"RM 2,500","RM 4,500 a month"
85,Analyst - Master Data,"RM 4,500 - RM 7,000 a month",None,"RM 4,500","RM 7,000 a month"
94,"Senior Analyst, Credit Review","RM 4,000 - RM 8,000 a month",'Senior',"RM 4,000","RM 8,000 a month"
113,System Analyst/Business Analyst,"RM 5,000 - RM 10,000 a month",None,"RM 5,000","RM 10,000 a month"

In [87]:
df_test.describe(include='object')

,Job_Title,Salary,Title_Keywords,A,B
count,614,614,131,614,525
unique,411,228,15,99,72
top,Data Analyst,"RM 4,000 - RM 4,500 a month",'Senior',"RM 4,000","RM 4,500 a month"
freq,29,29,65,82,72

In [88]:
df_test.loc[df_test['B'].isna()].head()

,Job_Title,Salary,Title_Keywords,A,B
232,Quality Analyst,"RM 13,000 a year",None,"RM 13,000 a year",None
297,Financial Analyst (Reporting & Analysis),"RM 3,500 a month",None,"RM 3,500 a month",None
368,Project Accountant (Financial Analyst) – Contract,"RM 12,000 a month",None,"RM 12,000 a month",None
461,Technical Test Lead,"RM 10,000 a month",'Lead',"RM 10,000 a month",None
478,Senior Software Engineer (Java),"RM 12,000 a month",'Senior',"RM 12,000 a month",None

In [89]:
# For Salary with no range, A = B
df_test.loc[df_test['B'].isna(), 'B'] = df_test.loc[df_test['B'].isna(), 'A']
df_test.describe(include='object')

,Job_Title,Salary,Title_Keywords,A,B
count,614,614,131,614,614
unique,411,228,15,99,111
top,Data Analyst,"RM 4,000 - RM 4,500 a month",'Senior',"RM 4,000","RM 4,500 a month"
freq,29,29,65,82,72

In [90]:
df_test['A'].unique()

array(['RM 2,000 ', 'RM 2,500 ', 'RM 4,500 ', 'RM 4,000 ', 'RM 5,000 ',
       'RM 5,500 ', 'RM 2,800 ', 'RM 3,500 ', 'RM 6,000 ', 'RM 333 ',
       'RM 13,000 a year', 'RM 3,000 ', 'RM 48,000 ', 'RM 2,400 ',
       'RM 8,000 ', 'RM 3,500 a month', 'RM 7,000 ', 'RM 12,000 a month',
       'RM 10,000 ', 'RM 7,500 ', 'RM 10,000 a month', 'RM 16,000 ',
       'RM 54,000 ', 'RM 4,000 a month', 'RM 5,500 a month', 'RM 36,000 ',
       'RM 1,800 ', 'RM 2,100 ', 'RM 44,000 ', 'RM 500 ', 'RM 3,300 ',
       'RM 9,000 ', 'RM 7,000 a month', 'RM 4,200 ', 'RM 1,600 ',
       'RM 3,800 ', 'RM 1,500 ', 'RM 11,000 ', 'RM 7,972 ',
       'RM 1,500 a month', 'RM 1,000 ', 'RM 800 ', 'RM 2,600 ',
       'RM 8,000 a month', 'RM 1,000 a month', 'RM 8,500 ',
       'RM 3,000 a month', 'RM 15,000 a month', 'RM 3,200 ', 'RM 6,500 ',
       'RM 6 an hour', 'RM 14,000 a year', 'RM 12,000 ',
       'RM 5,000 a month', 'RM 3,600 ', 'RM 174,000 a year', 'RM 60,000 ',
       'RM 15,000 ', 'RM 204,000 a year', 'RM 5,200 ', 'RM 90,000 a year',
       'RM 4,500 a month', 'RM 2,000 a month', 'RM 168,000 a year',
       'RM 2,597 ', 'RM 4,300 ', 'RM 9,000 a month', 'RM 18,000 ',
       'RM 70,000 a year', 'RM 108,000 a year', 'RM 800 a month',
       'RM 600 a month', 'RM 7,999 a month', 'RM 84,000 ',
       'RM 12,500 a month', 'RM 4,800 ', 'RM 3,300 a month',
       'RM 2,600 a month', 'RM 3,800 a month', 'RM 4,700 a month',
       'RM 4,600 a month', 'RM 6,300 ', 'RM 5,900 ', 'RM 6,500 a month',
       'RM 6,000 a month', 'RM 3,250 ', 'RM 3,650 ', 'RM 2,700 ',
       'RM 1,700 ', 'RM 4,900 ', 'RM 500 a month', 'RM 288,000 a year',
       'RM 1,450 a month', 'RM 4,600 ', 'RM 70,000 ', 'RM 300 ',
       'RM 11,000 a month', 'RM 5,197 ', 'RM 2,433 '], dtype=object)

In [91]:
df_test['B'].unique()

array([' RM 4,500 a month', ' RM 7,000 a month', ' RM 8,000 a month',
       ' RM 10,000 a month', ' RM 6,500 a month', ' RM 5,600 a month',
       ' RM 5,000 a month', ' RM 7,500 a month', ' RM 667 a week',
       ' RM 8,500 a month', 'RM 13,000 a year', ' RM 4,000 a month',
       ' RM 78,000 a year', ' RM 6,000 a month', ' RM 12,000 a month',
       'RM 3,500 a month', ' RM 5,500 a month', 'RM 12,000 a month',
       ' RM 18,000 a month', 'RM 10,000 a month', ' RM 5,200 a month',
       ' RM 3,200 a month', ' RM 3,300 a month', ' RM 3,000 a month',
       ' RM 3,500 a month', ' RM 19,000 a month', ' RM 69,600 a year',
       'RM 4,000 a month', ' RM 6,700 a month', ' RM 9,000 a month',
       'RM 5,500 a month', ' RM 50,000 a year', ' RM 2,800 a month',
       ' RM 4,300 a month', ' RM 700 a week', ' RM 68,000 a year',
       ' RM 9,500 a month', ' RM 12,500 a month', 'RM 7,000 a month',
       ' RM 1,800 a month', ' RM 5,800 a month', ' RM 2,400 a month',
       ' RM 4,800 a month', ' RM 2,000 a month', ' RM 10,022 a month',
       'RM 1,500 a month', ' RM 1,500 a month', ' RM 1,000 a month',
       'RM 8,000 a month', 'RM 1,000 a month', ' RM 1,700 a month',
       ' RM 2,700 a month', 'RM 3,000 a month', 'RM 15,000 a month',
       ' RM 4,200 a month', ' RM 2,500 a month', 'RM 6 an hour',
       'RM 14,000 a year', ' RM 9,999 a month', ' RM 13,000 a month',
       ' RM 6,200 a month', 'RM 5,000 a month', 'RM 174,000 a year',
       ' RM 75,000 a year', 'RM 204,000 a year', ' RM 9,500 a year',
       ' RM 2,900 a month', ' RM 8,300 a month', 'RM 90,000 a year',
       'RM 4,500 a month', ' RM 25,000 a month', ' RM 60,000 a year',
       'RM 2,000 a month', ' RM 17,000 a month', 'RM 168,000 a year',
       ' RM 96,000 a year', 'RM 9,000 a month', ' RM 15,000 a month',
       ' RM 22,000 a month', ' RM 7,200 a month', ' RM 11,000 a month',
       'RM 70,000 a year', 'RM 108,000 a year', 'RM 800 a month',
       ' RM 900 a month', 'RM 600 a month', 'RM 7,999 a month',
       ' RM 156,000 a year', 'RM 12,500 a month', ' RM 3,600 a month',
       'RM 3,300 a month', 'RM 2,600 a month', 'RM 3,800 a month',
       'RM 4,700 a month', ' RM 2,600 a month', ' RM 132,000 a year',
       'RM 4,600 a month', ' RM 20,000 a month', ' RM 6,900 a month',
       'RM 6,500 a month', 'RM 6,000 a month', ' RM 5,250 a month',
       'RM 500 a month', 'RM 288,000 a year', 'RM 1,450 a month',
       ' RM 5,400 a month', ' RM 130,000 a year', ' RM 500 a month',
       ' RM 3,400 a month', 'RM 11,000 a month', ' RM 3,041 a month'],
      dtype=object)

In [93]:
# Convert A and B to Numeric (float)
# df_test['A'] = df_test['A'].map(lambda x: x.lstrip('RM').rstrip('a month').rstrip('a year'))
# df_test['B'] = df_test['B'].map(lambda x: x.lstrip('RM').rstrip('a month').rstrip('a year'))
df_test['A'] = df_test['A'].map(lambda x: ''.join(filter(str.isdigit, x)))
df_test['B'] = df_test['B'].map(lambda x: ''.join(filter(str.isdigit, x)))
# df_test = df_test.loc[~df_test['A'].str.contains('an hou')]
# df_test = df_test.loc[~df_test['B'].str.contains('an hou')]
df_test['A'] = df_test['A'].map(lambda x: float(x.replace(',', '')))
df_test['B'] = df_test['B'].map(lambda x: float(x.replace(',', '')))
df_test.head()

,Job_Title,Salary,Title_Keywords,A,B
37,Data Analyst,"RM 2,000 - RM 4,500 a month",None,2000.0,4500.0
84,Master Data Analyst,"RM 2,500 - RM 4,500 a month",None,2500.0,4500.0
85,Analyst - Master Data,"RM 4,500 - RM 7,000 a month",None,4500.0,7000.0
94,"Senior Analyst, Credit Review","RM 4,000 - RM 8,000 a month",'Senior',4000.0,8000.0
113,System Analyst/Business Analyst,"RM 5,000 - RM 10,000 a month",None,5000.0,10000.0

In [94]:
df_test.describe()

                   A              B
count     614.000000     614.000000
mean     9146.340391   11654.234528
std     26792.011594   28921.796945
min         6.000000       6.000000
25%      3000.000000    4500.000000
50%      4000.000000    5600.000000
75%      6000.000000    8500.000000
max    288000.000000  288000.000000

In [95]:
# Convert years to month
df_test.loc[df_test['Salary'].str.contains('year'), 'A'] /= 12
df_test.loc[df_test['Salary'].str.contains('year'), 'B'] /= 12
df_test.loc[df_test['Salary'].str.contains('year')].head()

,Job_Title,Salary,Title_Keywords,A,B
232,Quality Analyst,"RM 13,000 a year",None,1083.333333,1083.333333
271,"Account Receivable, Analyst (AR)","RM 48,000 - RM 78,000 a year",None,4000.000000,6500.000000
658,Engineer (Network),"RM 54,000 - RM 69,600 a year",None,4500.000000,5800.000000
659,Engineer (Wintel/VMware),"RM 48,000 - RM 69,600 a year",None,4000.000000,5800.000000
733,"Junior General Ledger, GL Analyst (Mandarin/Ca...","RM 36,000 - RM 50,000 a year",'Junior',3000.000000,4166.666667

In [96]:
df_test.describe()

                  A             B
count    614.000000    614.000000
mean    4749.624864   6468.200326
std     2902.514150   3523.099336
min        6.000000      6.000000
25%     3000.000000   4500.000000
50%     4000.000000   5500.000000
75%     5500.000000   8000.000000
max    24000.000000  25000.000000

### Function for Easy Extraction

In [97]:
def extract_salary(df_job):
    df = df_job.copy()
    df[['Salary L', 'Salary U']] = df['Salary'].str.split('-', 1, expand=True)
    df = df[['Job_Title', 'Salary', 'Title_Keywords', 'Salary L', 'Salary U']]
    # Set Upper NaN to Lower
    df.loc[df['Salary U'].isna(), 'Salary U'] = df.loc[df['Salary U'].isna(), 'Salary L']
    # Convert to Numeric
    df['Salary L'] = df['Salary L'].map(lambda x: ''.join(filter(str.isdigit, x)))
    df['Salary U'] = df['Salary U'].map(lambda x: ''.join(filter(str.isdigit, x)))
    df['Salary L'] = df['Salary L'].map(lambda x: float(x.replace(',', '')))
    df['Salary U'] = df['Salary U'].map(lambda x: float(x.replace(',', '')))
    # Convert years to month
    df.loc[df['Salary'].str.contains('year'), 'Salary L'] /= 12
    df.loc[df['Salary'].str.contains('year'), 'Salary U'] /= 12
    return df

### Clean All Data

In [98]:
df_dac = extract_salary(df_das)
df_dac.head()

,Job_Title,Salary,Title_Keywords,Salary L,Salary U
37,Data Analyst,"RM 2,000 - RM 4,500 a month",None,2000.0,4500.0
84,Master Data Analyst,"RM 2,500 - RM 4,500 a month",None,2500.0,4500.0
85,Analyst - Master Data,"RM 4,500 - RM 7,000 a month",None,4500.0,7000.0
94,"Senior Analyst, Credit Review","RM 4,000 - RM 8,000 a month",'Senior',4000.0,8000.0
113,System Analyst/Business Analyst,"RM 5,000 - RM 10,000 a month",None,5000.0,10000.0

In [99]:
df_dac.describe()

           Salary L      Salary U
count    614.000000    614.000000
mean    4749.624864   6468.200326
std     2902.514150   3523.099336
min        6.000000      6.000000
25%     3000.000000   4500.000000
50%     4000.000000   5500.000000
75%     5500.000000   8000.000000
max    24000.000000  25000.000000

In [101]:
df_dec = extract_salary(df_des)
df_dec.head()

,Job_Title,Salary,Title_Keywords,Salary L,Salary U
95,Machine Learning Engineer,"RM 7,000 - RM 10,000 a month",None,7000.0,10000.0
125,Data Analyst,"RM 4,000 - RM 8,000 a month",None,4000.0,8000.0
126,Rotating Equipment Engineer,"RM 4,000 - RM 8,000 a month",None,4000.0,8000.0
153,QA Engineer,"RM 3,500 - RM 5,000 a month",None,3500.0,5000.0
156,EQUIPMENT ENGINEER [WK2144-38],"RM 2,300 a month",None,2300.0,2300.0

In [102]:
df_dec.describe()

           Salary L      Salary U
count    759.000000    759.000000
mean    4446.371542   6457.772947
std     2794.876269   3788.449984
min        7.000000      7.000000
25%     2500.000000   3500.000000
50%     4000.000000   6000.000000
75%     5250.000000   8000.000000
max    20000.000000  24000.000000

In [103]:
df_dsc = extract_salary(df_dss)
df_dsc.head()

,Job_Title,Salary,Title_Keywords,Salary L,Salary U
19,Data Analyst,"RM 2,000 - RM 4,500 a month",None,2000.0,4500.0
25,Data Engineer,"RM 3,500 - RM 5,000 a month",None,3500.0,5000.0
42,senior data engineer,"RM 13,000 - RM 17,000 a month",None,13000.0,17000.0
53,Data Scientist,"RM 4,500 - RM 7,000 a month",None,4500.0,7000.0
57,Food Lab Assistant,"RM 2,300 - RM 2,500 a month",None,2300.0,2500.0

In [104]:
df_dsc.describe()

           Salary L      Salary U
count     72.000000     72.000000
mean    6035.115741   8651.805556
std     4438.003823   5939.167117
min      500.000000    500.000000
25%     3500.000000   4500.000000
50%     4000.000000   5500.000000
75%     8000.000000  10022.000000
max    20000.000000  30000.000000

In [105]:
df_mlec = extract_salary(df_mles)
df_mlec.head()

,Job_Title,Salary,Title_Keywords,Salary L,Salary U
27,Artificial Intelligence (AI) Engineer (Lead/Sn...,"RM 10,000 a month",'Lead',10000.0,10000.0
38,Principal Engineer & Researcher (Data Science),"RM 9,200 - RM 20,000 a month",None,9200.0,20000.0
39,Software Engineer & Researcher (Data Science),"RM 2,500 - RM 5,800 a month",None,2500.0,5800.0
42,Software Engineer (Data Science) - Based in Cy...,"RM 4,500 - RM 7,500 a month",None,4500.0,7500.0
43,Special Training Programme for New Mechanical ...,RM 700 a month,'Graduate',700.0,700.0

In [106]:
df_mlec.describe()

           Salary L      Salary U
count     67.000000     67.000000
mean    5311.283582   7991.343284
std     3372.898595   4781.237286
min       10.000000     10.000000
25%     2550.000000   4750.000000
50%     4500.000000   7500.000000
75%     9000.000000  13000.000000
max    13000.000000  20000.000000